{"config": {"layers": [{"name": "inputImg", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "sparse": false, "name": "inputImg"}}, {"name": "batchnormalization_1", "inbound_nodes": [[["inputImg", 0, 0]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_1", "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "convolution2d_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [2, 2], "trainable": true, "nb_row": 5, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_1", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 24, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null}}, {"name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_2", "trainable": true, "axis": 1, "beta_regularizer": null, "mode": 0}}, {"name": "convolution2d_2", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [2, 2], "trainable": true, "nb_row": 5, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_2", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 36, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null}}, {"name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_3", "trainable": true, "axis": 1, "beta_regularizer": null, "mode": 0}}, {"name": "convolution2d_3", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [2, 2], "trainable": true, "nb_row": 5, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_3", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 48, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null}}, {"name": "convolution2d_4", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [2, 2], "trainable": true, "nb_row": 3, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_col": 3, "bias": true, "name": "convolution2d_4", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null}}, {"name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_4", "trainable": true, "axis": 1, "beta_regularizer": null, "mode": 0}}, {"name": "convolution2d_5", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "class_name": "Convolution2D", "config": {"subsample": [2, 2], "trainable": true, "nb_row": 3, "W_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_col": 3, "bias": true, "name": "convolution2d_5", "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activation": "elu", "W_regularizer": null}}, {"name": "flatten_1", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "config": {"input_dim": 192, "W_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 100, "activation": "elu", "bias": true}}, {"name": "batchnormalization_5", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_5", "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "dropout_1", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Dense", "config": {"input_dim": 100, "W_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_2", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 50, "activation": "elu", "bias": true}}, {"name": "batchnormalization_6", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_6", "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "dropout_2", "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense", "config": {"input_dim": 50, "W_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_3", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "activation": "elu", "bias": true}}, {"name": "batchnormalization_7", "inbound_nodes": [[["dense_3", 0, 0]]], "class_name": "BatchNormalization", "config": {"momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "name": "batchnormalization_7", "trainable": true, "axis": -1, "beta_regularizer": null, "mode": 0}}, {"name": "dense_4", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "class_name": "Dense", "config": {"input_dim": 10, "W_regularizer": null, "trainable": true, "b_constraint": null, "name": "dense_4", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "output_dim": 2, "activation": "linear", "bias": true}}], "name": "model_1", "input_layers": [["inputImg", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "class_name": "Model", "keras_version": "1.2.2"}