{"class_name": "Model", "config": {"input_layers": [["img", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "img", "config": {"batch_input_shape": [null, 80, 160, 3], "sparse": false, "input_dtype": "float32", "name": "img"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["img", 0, 0]]], "name": "batchnormalization_1", "config": {"trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_1", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "convolution2d_1", "config": {"W_constraint": null, "W_regularizer": null, "name": "convolution2d_1", "b_constraint": null, "border_mode": "valid", "bias": true, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 24, "activation": "elu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_2", "config": {"trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_2", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "convolution2d_2", "config": {"W_constraint": null, "W_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "border_mode": "valid", "bias": true, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 36, "activation": "elu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_3", "config": {"trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_3", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "convolution2d_3", "config": {"W_constraint": null, "W_regularizer": null, "name": "convolution2d_3", "b_constraint": null, "border_mode": "valid", "bias": true, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 48, "activation": "elu"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4", "config": {"W_constraint": null, "W_regularizer": null, "name": "convolution2d_4", "b_constraint": null, "border_mode": "valid", "bias": true, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 64, "activation": "elu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_4", "config": {"trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_4", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "axis": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "convolution2d_5", "config": {"W_constraint": null, "W_regularizer": null, "name": "convolution2d_5", "b_constraint": null, "border_mode": "valid", "bias": true, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 64, "activation": "elu"}}, {"class_name": "Flatten", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "config": {"W_constraint": null, "W_regularizer": null, "name": "dense_1", "b_constraint": null, "bias": true, "trainable": true, "output_dim": 100, "activity_regularizer": null, "input_dim": 192, "b_regularizer": null, "init": "glorot_uniform", "activation": "elu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_1", 0, 0]]], "name": "batchnormalization_5", "config": {"trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_5", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "dropout_1", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2", "config": {"W_constraint": null, "W_regularizer": null, "name": "dense_2", "b_constraint": null, "bias": true, "trainable": true, "output_dim": 50, "activity_regularizer": null, "input_dim": 100, "b_regularizer": null, "init": "glorot_uniform", "activation": "elu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_2", 0, 0]]], "name": "batchnormalization_6", "config": {"trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_6", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dropout", "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "dropout_2", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_3", "config": {"W_constraint": null, "W_regularizer": null, "name": "dense_3", "b_constraint": null, "bias": true, "trainable": true, "output_dim": 10, "activity_regularizer": null, "input_dim": 50, "b_regularizer": null, "init": "glorot_uniform", "activation": "elu"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["dense_3", 0, 0]]], "name": "batchnormalization_7", "config": {"trainable": true, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_7", "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Dense", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "dense_4", "config": {"W_constraint": null, "W_regularizer": null, "name": "dense_4", "b_constraint": null, "bias": true, "trainable": true, "output_dim": 3, "activity_regularizer": null, "input_dim": 10, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear"}}], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "1.2.1"}