{"keras_version": "1.2.2", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 160, 320, 3]}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D", "config": {"nb_filter": 24, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_row": 5, "name": "convolution2d_1", "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "nb_col": 5}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "elu_1", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"inbound_nodes": [[["elu_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D", "config": {"nb_filter": 36, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_row": 5, "name": "convolution2d_2", "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "nb_col": 5}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "elu_2", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"inbound_nodes": [[["elu_2", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D", "config": {"nb_filter": 48, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_row": 5, "name": "convolution2d_3", "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "subsample": [2, 2], "nb_col": 5}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "elu_3", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"inbound_nodes": [[["elu_3", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_row": 3, "name": "convolution2d_4", "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "nb_col": 3}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "elu_4", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"inbound_nodes": [[["elu_4", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D", "config": {"nb_filter": 64, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_row": 3, "name": "convolution2d_5", "activation": "linear", "W_regularizer": {"l2": 0.0010000000474974513, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "nb_col": 3}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "elu_5", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"inbound_nodes": [[["elu_5", 0, 0]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"input_dim": 27456, "W_constraint": null, "b_constraint": null, "name": "dense_1", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "output_dim": 50, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "elu_6", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"inbound_nodes": [[["elu_6", 0, 0]]], "name": "dense_2", "class_name": "Dense", "config": {"input_dim": 50, "W_constraint": null, "b_constraint": null, "name": "dense_2", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "output_dim": 100, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "elu_7", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"inbound_nodes": [[["elu_7", 0, 0]]], "name": "dropout_1", "class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_1", "trainable": true}}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_4", "class_name": "Dense", "config": {"input_dim": 100, "W_constraint": null, "b_constraint": null, "name": "dense_4", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "output_dim": 100, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_4", 0, 0]]], "name": "elu_8", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"inbound_nodes": [[["elu_8", 0, 0]]], "name": "dropout_2", "class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_2", "trainable": true}}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_5", "class_name": "Dense", "config": {"input_dim": 100, "W_constraint": null, "b_constraint": null, "name": "dense_5", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "output_dim": 50, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_5", 0, 0]]], "name": "elu_9", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"inbound_nodes": [[["elu_9", 0, 0]]], "name": "dropout_3", "class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_3", "trainable": true}}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "dense_6", "class_name": "Dense", "config": {"input_dim": 50, "W_constraint": null, "b_constraint": null, "name": "dense_6", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "output_dim": 10, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_6", 0, 0]]], "name": "elu_10", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_10", "trainable": true}}, {"inbound_nodes": [[["elu_7", 0, 0]]], "name": "dense_3", "class_name": "Dense", "config": {"input_dim": 100, "W_constraint": null, "b_constraint": null, "name": "dense_3", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "output_dim": 1000, "activity_regularizer": null}}, {"inbound_nodes": [[["elu_10", 0, 0]]], "name": "dense_7", "class_name": "Dense", "config": {"input_dim": 10, "W_constraint": null, "b_constraint": null, "name": "dense_7", "activation": "linear", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "output_dim": 1, "activity_regularizer": null}}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}}], "name": "model_1", "output_layers": [["dense_7", 0, 0], ["activation_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}