{"class_name": "Model", "keras_version": "1.2.2", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0], ["speed_input", 0, 0], ["position_cte", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"input_dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 80, 160, 3]}}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_1", "nb_filter": 24, "bias": true, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null}}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "elu_1", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"inbound_nodes": [[["elu_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_2", "nb_filter": 36, "bias": true, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null}}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "elu_2", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"inbound_nodes": [[["elu_2", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D", "config": {"subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "bias": true, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "nb_col": 5, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null}}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "elu_3", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"inbound_nodes": [[["elu_3", 0, 0]]], "name": "convolution2d_4", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "bias": true, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null}}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "elu_4", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"inbound_nodes": [[["elu_4", 0, 0]]], "name": "convolution2d_5", "class_name": "Convolution2D", "config": {"subsample": [1, 1], "b_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "bias": true, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "nb_col": 3, "dim_ordering": "tf", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.0010000000474974513, "l1": 0.0}, "W_constraint": null}}, {"inbound_nodes": [], "name": "speed_input", "class_name": "InputLayer", "config": {"input_dtype": "float32", "name": "speed_input", "sparse": false, "batch_input_shape": [null, 8]}}, {"inbound_nodes": [], "name": "position_cte", "class_name": "InputLayer", "config": {"input_dtype": "float32", "name": "position_cte", "sparse": false, "batch_input_shape": [null, 1]}}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "elu_5", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"inbound_nodes": [[["speed_input", 0, 0]]], "name": "dense_1", "class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_1", "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "output_dim": 100, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 8}}, {"inbound_nodes": [[["position_cte", 0, 0]]], "name": "dense_2", "class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_2", "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "output_dim": 100, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 1}}, {"inbound_nodes": [[["elu_5", 0, 0]]], "name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "elu_6", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "elu_7", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"inbound_nodes": [[["flatten_1", 0, 0], ["elu_6", 0, 0], ["elu_7", 0, 0]]], "name": "merge_1", "class_name": "Merge", "config": {"output_shape_type": "raw", "concat_axis": -1, "output_shape": null, "arguments": {}, "dot_axes": -1, "output_mask": null, "mode_type": "raw", "name": "merge_1", "output_mask_type": "raw", "mode": "concat"}}, {"inbound_nodes": [[["merge_1", 0, 0]]], "name": "dense_3", "class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_3", "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "output_dim": 100, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 2696}}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "elu_8", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"inbound_nodes": [[["elu_8", 0, 0]]], "name": "dense_4", "class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_4", "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "output_dim": 50, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 100}}, {"inbound_nodes": [[["dense_4", 0, 0]]], "name": "elu_9", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_9", "trainable": true}}, {"inbound_nodes": [[["elu_9", 0, 0]]], "name": "dense_5", "class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_5", "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "output_dim": 10, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 50}}, {"inbound_nodes": [[["dense_5", 0, 0]]], "name": "elu_10", "class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_10", "trainable": true}}, {"inbound_nodes": [[["elu_10", 0, 0]]], "name": "dense_6", "class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_6", "W_regularizer": null, "bias": true, "activity_regularizer": null, "W_constraint": null, "output_dim": 3, "trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "input_dim": 10}}], "output_layers": [["dense_6", 0, 0]]}}