{"keras_version": "1.2.2", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0], ["speed_input", 0, 0], ["position_cte", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 80, 160, 3], "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "convolution2d_1", "config": {"b_regularizer": null, "border_mode": "valid", "nb_filter": 24, "bias": true, "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_1", "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "subsample": [2, 2], "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "ELU", "name": "elu_1", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_2", "config": {"b_regularizer": null, "border_mode": "valid", "nb_filter": 36, "bias": true, "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_2", "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "subsample": [2, 2], "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}}, "inbound_nodes": [[["elu_1", 0, 0]]]}, {"class_name": "ELU", "name": "elu_2", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_3", "config": {"b_regularizer": null, "border_mode": "valid", "nb_filter": 48, "bias": true, "init": "glorot_uniform", "nb_col": 5, "name": "convolution2d_3", "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "subsample": [2, 2], "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}}, "inbound_nodes": [[["elu_2", 0, 0]]]}, {"class_name": "ELU", "name": "elu_3", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_4", "config": {"b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "bias": true, "init": "glorot_uniform", "nb_col": 3, "name": "convolution2d_4", "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}}, "inbound_nodes": [[["elu_3", 0, 0]]]}, {"class_name": "InputLayer", "name": "speed_input", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 8], "name": "speed_input"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "position_cte", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 2], "name": "position_cte"}, "inbound_nodes": []}, {"class_name": "ELU", "name": "elu_4", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"b_regularizer": null, "input_dim": 8, "output_dim": 50, "bias": true, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["speed_input", 0, 0]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"b_regularizer": null, "input_dim": 2, "output_dim": 50, "bias": true, "init": "glorot_uniform", "name": "dense_3", "activity_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["position_cte", 0, 0]]]}, {"class_name": "Convolution2D", "name": "convolution2d_5", "config": {"b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "bias": true, "init": "glorot_uniform", "nb_col": 3, "name": "convolution2d_5", "dim_ordering": "tf", "activity_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "subsample": [1, 1], "W_regularizer": {"l2": 0.0010000000474974513, "l1": 0.0, "name": "L1L2Regularizer"}}, "inbound_nodes": [[["elu_4", 0, 0]]]}, {"class_name": "ELU", "name": "elu_6", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "ELU", "name": "elu_8", "config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "inbound_nodes": [[["dense_3", 0, 0]]]}, {"class_name": "ELU", "name": "elu_5", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"b_regularizer": null, "input_dim": 50, "output_dim": 100, "bias": true, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["elu_6", 0, 0]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"b_regularizer": null, "input_dim": 50, "output_dim": 100, "bias": true, "init": "glorot_uniform", "name": "dense_4", "activity_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["elu_8", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["elu_5", 0, 0]]]}, {"class_name": "ELU", "name": "elu_7", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "ELU", "name": "elu_9", "config": {"alpha": 1.0, "trainable": true, "name": "elu_9"}, "inbound_nodes": [[["dense_4", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"output_shape_type": "raw", "arguments": {}, "dot_axes": -1, "mode": "concat", "output_shape": null, "name": "merge_1", "output_mask_type": "raw", "output_mask": null, "concat_axis": -1, "mode_type": "raw"}, "inbound_nodes": [[["flatten_1", 0, 0], ["elu_7", 0, 0], ["elu_9", 0, 0]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"b_regularizer": null, "input_dim": 2696, "output_dim": 100, "bias": true, "init": "glorot_uniform", "name": "dense_5", "activity_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "ELU", "name": "elu_10", "config": {"alpha": 1.0, "trainable": true, "name": "elu_10"}, "inbound_nodes": [[["dense_5", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"p": 0.6, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["elu_10", 0, 0]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"b_regularizer": null, "input_dim": 100, "output_dim": 50, "bias": true, "init": "glorot_uniform", "name": "dense_6", "activity_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "ELU", "name": "elu_11", "config": {"alpha": 1.0, "trainable": true, "name": "elu_11"}, "inbound_nodes": [[["dense_6", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"p": 0.6, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["elu_11", 0, 0]]]}, {"class_name": "Dense", "name": "dense_7", "config": {"b_regularizer": null, "input_dim": 50, "output_dim": 10, "bias": true, "init": "glorot_uniform", "name": "dense_7", "activity_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "ELU", "name": "elu_12", "config": {"alpha": 1.0, "trainable": true, "name": "elu_12"}, "inbound_nodes": [[["dense_7", 0, 0]]]}, {"class_name": "Dense", "name": "dense_8", "config": {"b_regularizer": null, "input_dim": 10, "output_dim": 3, "bias": true, "init": "glorot_uniform", "name": "dense_8", "activity_regularizer": null, "trainable": true, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "inbound_nodes": [[["elu_12", 0, 0]]]}], "output_layers": [["dense_8", 0, 0]], "name": "model_1"}}