{"keras_version": "1.2.2", "config": {"input_layers": [["inputImg", 0, 0]], "output_layers": [["dense_4", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "sparse": false, "name": "inputImg"}, "name": "inputImg", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "trainable": true, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_1"}, "name": "batchnormalization_1", "inbound_nodes": [[["inputImg", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "name": "convolution2d_1", "nb_filter": 24, "activity_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null}, "name": "convolution2d_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": 1, "trainable": true, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_2"}, "name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "name": "convolution2d_2", "nb_filter": 36, "activity_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null}, "name": "convolution2d_2", "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": 1, "trainable": true, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_3"}, "name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 5, "nb_col": 5, "border_mode": "valid", "name": "convolution2d_3", "nb_filter": 48, "activity_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null}, "name": "convolution2d_3", "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "name": "convolution2d_4", "nb_filter": 64, "activity_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null}, "name": "convolution2d_4", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": 1, "trainable": true, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_4"}, "name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "name": "convolution2d_5", "nb_filter": 64, "activity_regularizer": null, "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "subsample": [2, 2], "W_regularizer": null, "b_regularizer": null}, "name": "convolution2d_5", "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "output_dim": 100, "name": "dense_1", "input_dim": 192, "activity_regularizer": null, "activation": "elu", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null}, "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "trainable": true, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_5"}, "name": "batchnormalization_5", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "name": "dropout_1", "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "output_dim": 50, "name": "dense_2", "input_dim": 100, "activity_regularizer": null, "activation": "elu", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "trainable": true, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_6"}, "name": "batchnormalization_6", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "name": "dropout_2", "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "output_dim": 10, "name": "dense_3", "input_dim": 50, "activity_regularizer": null, "activation": "elu", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "axis": -1, "trainable": true, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_7"}, "name": "batchnormalization_7", "inbound_nodes": [[["dense_3", 0, 0]]]}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "output_dim": 2, "name": "dense_4", "input_dim": 10, "activity_regularizer": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_regularizer": null, "b_constraint": null}, "name": "dense_4", "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}]}, "class_name": "Model"}