{"class_name": "Model", "keras_version": "1.2.2", "config": {"output_layers": [["dense_4", 0, 0]], "name": "model_1", "input_layers": [["inputImg", 0, 0]], "layers": [{"inbound_nodes": [], "name": "inputImg", "config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 80, 160, 3], "name": "inputImg"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["inputImg", 0, 0]]], "name": "batchnormalization_1", "config": {"momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "convolution2d_1", "config": {"W_constraint": null, "subsample": [2, 2], "name": "convolution2d_1", "nb_filter": 24, "border_mode": "valid", "nb_col": 5, "nb_row": 5, "trainable": true, "activation": "elu", "b_constraint": null, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_2", "config": {"momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "axis": 1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "convolution2d_2", "config": {"W_constraint": null, "subsample": [2, 2], "name": "convolution2d_2", "nb_filter": 36, "border_mode": "valid", "nb_col": 5, "nb_row": 5, "trainable": true, "activation": "elu", "b_constraint": null, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_3", "config": {"momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "axis": 1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "convolution2d_3", "config": {"W_constraint": null, "subsample": [2, 2], "name": "convolution2d_3", "nb_filter": 48, "border_mode": "valid", "nb_col": 5, "nb_row": 5, "trainable": true, "activation": "elu", "b_constraint": null, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "convolution2d_4", "config": {"W_constraint": null, "subsample": [2, 2], "name": "convolution2d_4", "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "elu", "b_constraint": null, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_4", "config": {"momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "axis": 1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "convolution2d_5", "config": {"W_constraint": null, "subsample": [2, 2], "name": "convolution2d_5", "nb_filter": 64, "border_mode": "valid", "nb_col": 3, "nb_row": 3, "trainable": true, "activation": "elu", "b_constraint": null, "init": "glorot_uniform", "bias": true, "dim_ordering": "tf", "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "config": {"W_constraint": null, "name": "dense_1", "trainable": true, "output_dim": 100, "activation": "elu", "b_constraint": null, "init": "glorot_uniform", "input_dim": 192, "activity_regularizer": null, "bias": true, "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0]]], "name": "batchnormalization_5", "config": {"momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 0, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_2", "config": {"W_constraint": null, "name": "dense_2", "trainable": true, "output_dim": 50, "activation": "elu", "b_constraint": null, "init": "glorot_uniform", "input_dim": 100, "activity_regularizer": null, "bias": true, "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0]]], "name": "batchnormalization_6", "config": {"momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "mode": 0, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_3", "config": {"W_constraint": null, "name": "dense_3", "trainable": true, "output_dim": 10, "activation": "elu", "b_constraint": null, "init": "glorot_uniform", "input_dim": 50, "activity_regularizer": null, "bias": true, "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0]]], "name": "batchnormalization_7", "config": {"momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_7", "epsilon": 0.001, "trainable": true, "mode": 0, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "dense_4", "config": {"W_constraint": null, "name": "dense_4", "trainable": true, "output_dim": 2, "activation": "linear", "b_constraint": null, "init": "glorot_uniform", "input_dim": 10, "activity_regularizer": null, "bias": true, "b_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}]}}